import java.util.Arrays;

// 3. Создать квадратный двумерный целочисленный массив (количество строк и столбцов одинаковое),
//  * и с помощью цикла(-ов) заполнить его диагональные элементы единицами (можно только одну из диагоналей, если обе сложно). 
//  * Определить элементы одной из диагоналей можно по следующему принципу: индексы таких элементов равны, то есть [0][0], [1][1], [2][2], …, [n][n];
/**
 * hw3
 */
public class hw3 {
  public static void main(String[] args) {
    int n = 7;
    int[][] array = new int[n][n];

    for (int i = 0; i < n; i++) {
      for (int j = 0; j < n; j++) {
        if (i == j || i + j == n - 1) {
          array[i][j] = 1;
        }
      }
    }
    System.out.println(Arrays.deepToString(array));
  }
}
